console.log("일해라 부하들");

setTimeout(() => {
    console.log("팀장: 일 끝!");
}, 1000);


setTimeout(() => {
    console.log("팀원1: 일 끝!");
}, 1500);

setTimeout(() => {
    console.log("인턴: 일 끝!");
}, 2000);

console.log("일 다했습니다!!!");


/* setTimeout 함수 자체의 실행은 즉시 실행되고 리턴됨.
    순식간에 제일 아래까지 코드 실행이 완료됨.
    setTimeout 함수가 즉시 종료되는 이유는 작업을 예약하는 일이 전부이기 때문.
    예약하는 것 자체는 단숨에 끝남.
*/


/**
 * setTimeout 은 인자로 들어온 콜백 함수를 예약하기만 하고 바로 끝난다.
setTimeout 에 의해 기다리는 동작은 본래의 코드 흐름과는 상관 없이 따로따로 독립적으로 돌아간다. 
(위 그림처럼 세 개 동시에 기다리는 모습이다.)
이렇게 따로따로 독립적으로 돌아가는 작업을 비동기 작업이라고 한다.
 */